EDT/УТ/src/DataProcessors/новаАвтоматическоеФормированиеМестнойДоставки/новаАвтоматическоеФормированиеМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>новаАвтоматическоеФормированиеМестнойДоставки</name>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладГрузополучатель</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/новаКалендарьПраздничныхДней/новаКалендарьПраздничныхДней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаКалендарьПраздничныхДней</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.новаВидыДнейКалендаряПраздничныхДней</types>
    </type>
  </resources>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаРайоныАдресов/новаРайоныАдресов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаРайоныАдресов</name>
  <dimensions>
    <name>Классификатор</name>
    <type>
      <types>CatalogRef.новаКлассификаторРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Район</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаОбслуживаемыеРайоныСкладов/новаОбслуживаемыеРайоныСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаОбслуживаемыеРайоныСкладов</name>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГеоРайон</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/новаВидыДнейКалендаряПраздничныхДней/новаВидыДнейКалендаряПраздничныхДней.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>новаВидыДнейКалендаряПраздничныхДней</name>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>ПеренесенныйВыходной</name>
  </enumValues>
  <enumValues>
    <name>ПеренесенныйРабочий</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/новаГруз/новаГруз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаГруз</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Маркировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.новаВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЕдиницПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеревезеноПалетт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияПеревозки</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.новаУсловияПеревозки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.новаВалюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>CatalogRef.новаСтраны</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.новаКатегорииГрузов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/новаТочкиДоставки/новаТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТочкиДоставки</name>
  <attributes>
    <name>ВладелецТочки</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребывания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаПланирования</name>
    <type>
      <types>CatalogRef.новаСменыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыДоставкиЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПосещения</name>
    <type>
      <types>CatalogRef.новаРежимыПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Радиус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонПогрузкиРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахождениеТранспортаВРадиусе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.новаПриоритетыТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзЯндекса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Москва</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемВывоза</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаРежимыПосещенияТочекДоставки/новаРежимыПосещенияТочекДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРежимыПосещенияТочекДоставки</name>
  <attributes>
    <name>ВидРасписания</name>
    <type>
      <types>EnumRef.новаВидыРасписанийПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУчетаПраздников</name>
    <type>
      <types>EnumRef.новаСпособыУчетаПраздников</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниНеделиНумероватьСКонцаМесяца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧислаМесяца</name>
    <attributes>
      <name>ЧислоМесяца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.новаДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДниНеделиМесяца</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.новаДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/новаАвтоматическоеФормированиеМестнойДоставки/ObjectModule.bsl
// Формирует доставки на заданную дату согласно расписанию доставки.
//
// Параметры:
//  ДатаФормирования <Дата>
//  Индикатор        <Индикатор>: индикатор для отображения прогресса.
//
Процедура СформироватьДоставки(ДатаФормирования, Индикатор = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	День
	|ИЗ
	|	РегистрСведений.новаКалендарьПраздничныхДней
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(День, Месяц) = &Месяц
	| И ВидДня <> ЗНАЧЕНИЕ(Перечисление.новаВидыДнейКалендаряПраздничныхДней.ПеренесенныйРабочий)";
	
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаФормирования));
	
	соПраздники = Новый Соответствие;	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		соПраздники.Вставить(Выборка.День, Истина);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	новаТочкиДоставки.РежимПосещения КАК РежимПосещения,
	|	новаТочкиДоставки.Ссылка КАК ТочкаДоставки,
	|	МАКСИМУМ(новаОбслуживаемыеРайоныСкладов.Склад) КАК Склад,
	|	МАКСИМУМ(новаОбслуживаемыеРайоныСкладов.Склад.ТочкаДоставки) КАК ТочкаДоставкиСклада,
	|	ЕСТЬNULL(новаРайоныАдресов.Район, НЕОПРЕДЕЛЕНО) КАК Район,
	|	МАКСИМУМ(ЕСТЬNULL(новаОбслуживаемыеРайоныСкладов.Склад, НЕОПРЕДЕЛЕНО)) КАК СкладСчетчик,
	|	новаТочкиДоставки.ВладелецТочки КАК ВладелецТочки
	|ИЗ
	|	Справочник.новаТочкиДоставки КАК новаТочкиДоставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаРайоныАдресов КАК новаРайоныАдресов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаОбслуживаемыеРайоныСкладов КАК новаОбслуживаемыеРайоныСкладов
	|			ПО новаРайоныАдресов.Район = новаОбслуживаемыеРайоныСкладов.ГеоРайон
	|		ПО новаТочкиДоставки.Адрес = новаРайоныАдресов.Адрес
	|ГДЕ
	|	НЕ новаТочкиДоставки.ПометкаУдаления
	|	И НЕ новаТочкиДоставки.ВладелецТочки.ПометкаУдаления
	|	И новаТочкиДоставки.ВладелецТочки ССЫЛКА Справочник.новаКонтрагенты
	|	И новаТочкиДоставки.РежимПосещения <> ЗНАЧЕНИЕ(Справочник.новаРежимыПосещенияТочекДоставки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	новаТочкиДоставки.Ссылка,
	|	новаТочкиДоставки.РежимПосещения,
	|	ЕСТЬNULL(новаРайоныАдресов.Район, НЕОПРЕДЕЛЕНО),
	|	новаТочкиДоставки.ВладелецТочки
	|ИТОГИ
	|	МАКСИМУМ(РежимПосещения),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(ТочкаДоставкиСклада),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СкладСчетчик),
	|	МАКСИМУМ(ВладелецТочки)
	|ПО
	|	ТочкаДоставки";
	    		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Индикатор <> Неопределено Тогда
		Индикатор.МинимальноеЗначение = 0;
		Индикатор.МаксимальноеЗначение = Выборка.Количество() - 1; 
	КонецЕсли;
	
	соДатыРежимовПосещения = Новый Соответствие;
	
	ъ = 0;
	ЗаписаноДоставок = 0;
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		Отказ = Ложь;
		
		Если Индикатор <> Неопределено Тогда
			Индикатор.Значение = ъ;
			ъ = ъ + 1;
		КонецЕсли;                                           
		
		соДаты = соДатыРежимовПосещения[Выборка.РежимПосещения];
		Если соДаты = Неопределено Тогда
			обРежимПосещения = Выборка.РежимПосещения.ПолучитьОбъект();
			соДаты = обРежимПосещения.ПолучитьДниПосещения(ДатаФормирования, соПраздники);
			соДатыРежимовПосещения.Вставить(Выборка.РежимПосещения, соДаты);
		КонецЕсли;
		
		стОкно = соДаты[ДатаФормирования];
		Если стОкно = Неопределено Тогда Продолжить; КонецЕсли;
		
		Если ЗначениеЗаполнено(стОкно.ВремяНачала) Тогда
			ВремяПрибытияС = стОкно.ВремяНачала;
		Иначе
			ВремяПрибытияС = Выборка.ТочкаДоставки.ВремяРаботыНачало;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стОкно.ВремяОкончания) Тогда
			ВремяПрибытияПо = стОкно.ВремяОкончания;
		Иначе
			ВремяПрибытияПо = Выборка.ТочкаДоставки.ВремяРаботыОкончание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стОкно.ВремяПребывания) Тогда
			ВремяПребыванияГрузополучателя = стОкно.ВремяПребывания;
		Иначе
			ВремяПребыванияГрузополучателя = Выборка.ТочкаДоставки.ВремяПребывания;
		КонецЕсли;
		
		НачатьТранзакцию();
		обГруз = Документы.новаГруз.СоздатьДокумент();
		обГруз.Дата = ДатаФормирования;
		
		Для Каждого стрТовар Из Выборка.ТочкаДоставки.ОбъемВывоза Цикл
			стрСпецификация = обГруз.Спецификация.Добавить();
			стрСпецификация.Артикул = стрТовар.Товар.Код;
			стрСпецификация.Товар = стрТовар.Товар;
			
			Если стрТовар.ЕдиницаИзмерения.Владелец = стрТовар.Товар Тогда
				стрСпецификация.ЕдиницаИзмерения = стрТовар.ЕдиницаИзмерения;
			Иначе
				стрСпецификация.ЕдиницаИзмерения = Справочники.новаЕдиницыНоменклатуры.НайтиПоНаименованию("шт",,, стрТовар.Товар);
			КонецЕсли;
			
			стрСпецификация.Количество = стрТовар.Количество;
			стрСпецификация.Объем = стрСпецификация.ЕдиницаИзмерения.Объем * стрТовар.Количество;
			стрСпецификация.Вес = стрСпецификация.ЕдиницаИзмерения.Вес * стрТовар.Количество;
		КонецЦикла;
		
		обГруз.Вес = обГруз.Спецификация.Итог("Вес");
		обГруз.Объем = обГруз.Спецификация.Итог("Объем");
		обГруз.Записать(РежимЗаписиДокумента.Проведение);
		
		обДоставка = БизнесПроцессы.новаМестнаяДоставка.СоздатьБизнесПроцесс();
		обДоставка.Дата = ДатаФормирования;
		обДоставка.Груз = обГруз.Ссылка;
		Если Грузополучатель = "Контрагент" Тогда
			обДоставка.Грузополучатель = Выборка.ВладелецТочки;
			обДоставка.ТочкаПрибытия = Выборка.ТочкаДоставки;
		ИначеЕсли Грузополучатель = "СкладПоРайону" Тогда
			
			Если Выборка.СкладСчетчик > 1 Тогда
				
				ВыборкаРайоны = Выборка.Выбрать();
				ТекстСообщения = "Не удалось определить грузополучателя для точки: " + Выборка.ТочкаДоставки + " - обнаружено пересечение районов (";
				Пока ВыборкаРайоны.Следующий() Цикл
					ТекстСообщения = ТекстСообщения + ВыборкаРайоны.Район + ", ";
				КонецЦикла;
				Если Прав(ТекстСообщения, 2) = ", " Тогда
					ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения) - 2);
				КонецЕсли;
				ТекстСообщения = ТекстСообщения + ")";							
				
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				
			Иначе
				
				обДоставка.Грузополучатель = Выборка.Склад;
				обДоставка.ТочкаПрибытия = Выборка.ТочкаДоставкиСклада;
				Если обДоставка.Грузополучатель = Неопределено Тогда
					Сообщить("Не удалось определить грузополучателя для точки: " + Выборка.ТочкаДоставки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Грузополучатель = "Склад" Тогда
			обДоставка.Грузополучатель = СкладГрузополучатель;
			обДоставка.ТочкаПрибытия = СкладГрузополучатель.ТочкаДоставки;
		КонецЕсли;
		Если Грузоотправитель = "Контрагент" Тогда
			обДоставка.Грузоотправитель = Выборка.ВладелецТочки;
			обДоставка.ТочкаОтправления = Выборка.ТочкаДоставки;
		ИначеЕсли Грузоотправитель = "СкладПоРайону" Тогда
			
			Если Выборка.СкладСчетчик > 1 Тогда
				
				ВыборкаРайоны = Выборка.Выбрать();
				ТекстСообщения = "Не удалось определить грузоотправителя для точки: " + Выборка.ТочкаДоставки + " - обнаружено пересечение районов (";
				Пока ВыборкаРайоны.Следующий() Цикл
					ТекстСообщения = ТекстСообщения + ВыборкаРайоны.Район + ", ";
				КонецЦикла;
				Если Прав(ТекстСообщения, 2) = ", " Тогда
					ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения) - 2);
				КонецЕсли;
				ТекстСообщения = ТекстСообщения + ")";							
				
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				
			Иначе
				
				обДоставка.Грузоотправитель = Выборка.Склад;
				обДоставка.ТочкаОтправления = Выборка.ТочкаДоставкиСклада;
				Если обДоставка.Грузоотправитель = Неопределено Тогда
					Сообщить("Не удалось определить грузоотправителя для точки: " + Выборка.ТочкаДоставки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
			
			
		ИначеЕсли Грузоотправитель = "Склад" Тогда
			обДоставка.Грузоотправитель = Склад;
			обДоставка.ТочкаОтправления = Склад.ТочкаДоставки;
		КонецЕсли;
		
		обДоставка.ВремяОтправленияС = ДатаФормирования + (обДоставка.ТочкаОтправления.ВремяРаботыНачало - '00010101');
		обДоставка.ВремяОтправленияПо = ДатаФормирования + (обДоставка.ТочкаОтправления.ВремяРаботыОкончание - '00010101');
		обДоставка.ВремяПребыванияГрузоотправителя = обДоставка.ТочкаОтправления.ВремяПребывания;
		обДоставка.ВремяПрибытияС = ДатаФормирования + (ВремяПрибытияС - '00010101');
		обДоставка.ВремяПрибытияПо = ДатаФормирования + (ВремяПрибытияПо - '00010101');
		обДоставка.ВремяПребыванияГрузополучателя = ВремяПребыванияГрузополучателя;
		
		Для Каждого стрКатегория Из Выборка.ТочкаДоставки.КатегорииТранспорта Цикл
			ЗаполнитьЗначенияСвойств(обДоставка.КатегорииТранспорта.Добавить(), стрКатегория);
		КонецЦикла;
		обДоставка.КоличествоВыбранныхКатегорий = Выборка.ТочкаДоставки.КоличествоВыбранныхКатегорий;
		
		Если НЕ Отказ Тогда
			обДоставка.Записать();
			обДоставка.Старт();
			ЗаписаноДоставок = ЗаписаноДоставок + 1;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	Сообщить("Создано " + ЗаписаноДоставок + " доставок");
КонецПроцедуры
